<!doctype html>
 
<html lang="it">
<head>
  <meta charset="iso-8859-1" />
  <title>FAQ - NEXU</title>
  <link rel="SHORTCUT ICON" href="http://10.24.5.144/nexu/_graphics/favicon.ico">
  <link rel="stylesheet" href="http://code.jquery.com/ui/1.10.3/themes/smoothness/jquery-ui.css" />
  <script src="http://code.jquery.com/jquery-1.9.1.js"></script>
  <script src="http://code.jquery.com/ui/1.10.3/jquery-ui.js"></script>
  <link rel="stylesheet" href="/resources/demos/style.css" />
  <script>
  $(function() {
    $( "#accordion" ).accordion({
      heightStyle: "content"
    });
  });
  </script>
  <style type="text/css">
	p {
	text-align:justify;
	}
  </style>
</head>
<body>
 
<div id="accordion">
<h3>Come faccio a trovare un utente?</h3>
<div>
<p>Nel caso in cui si sta cercando un utente specifico basta scrivere semplicemente il suo nome nella barra di ricerca in alto. Qualora, invece, si voglia vedere gli utenti iscritti sulla community basta seguire il link <a href="http://10.24.5.144/nexu/members" target="_blank"><em>Tutti gli utenti</em></a> sulla barra laterale sinistra della homepage.</p>
</div>
<h3>Come si fa a seguire qualcuno?</h3>
<div>
<p>Basta andare sul suo profilo (cliccando sul nome o sulla foto della persona in questione) e cliccare sul link <em>Segui</em> in alto a destra.</p>
</div>
<h3>Come faccio ad essere notificato anche quando non sono connesso su NEXU?</h3>
<div>
<p>Allo scopo c'è un'applicazione apposita, scaricabile da questo link: <a href="http://10.24.5.144/nexu/file/download/3308" target="_blank">NEXU Desktop Notifications</a>. Per installarlo basta estrarre il zip ed avviare <em>install.bat</em></p>
</div>
<h3>Come faccio a sapere quali sono i gruppi disponibili? Perch&eacute; questi gruppi?</h3>
<div>
<p>I gruppi sono reperibili dalla barra laterale sinistra cliccando sugli appositi link. Esistono due tipi di gruppi: <a href="http://10.24.5.144/nexu/groups/all?filter=closed" target="_blank">chiusi</a> e <a href="http://10.24.5.144/nexu/groups/all?filter=open" target="_blank">aperti</a>.</p>
<p>I gruppi chiusi sono gruppi di progetto, a cui non &egrave; possibile iscriversi finch&eacute; l&rsquo;amministratore del gruppo non accetta la richiesta di iscrizione.</p>
<p>I gruppi aperti, invece, sono gruppi tematici, trasversali ai progetti, a cui &egrave; possibile iscriversi liberamente.</p>
</div>
<h3>Come si fa ad iscriversi ad un gruppo?</h3>
<div>
<p>Basta andare sul gruppo e cliccare sul pulsante in alto a destra (con etichetta <em>Richiedi iscrizione</em> per i gruppi chiusi, e <em>Iscriviti</em> al gruppo per i gruppi aperti).</p>
</div>
<h3>Come si fa ad aggiungere un blog post o un segnalibro in un gruppo?</h3>
<div>
<p>Per inserire un nuovo blog post in un gruppo, dalla pagina di quest&rsquo;ultimo basta seguire il link <em>Il blog del gruppo</em> sulla barra laterale sinistra. Ti ritroverai in una pagina nel quale sar&agrave; mostrata una lista dei blog post inseriti fino a quel momento e, cliccando sul pulsante in alto <em>Aggiungi un post nel blog</em>, sar&agrave; possibile inserire un nuovo post nel gruppo.</p>
<p>Discorso analogo per i segnalibri: all&rsquo;interno del gruppo, invece di seguire il link Il blog del gruppo &egrave; necessario seguire il link <em>Segnalibri del gruppo</em> e poi cliccare sul pulsante in alto a destra <em>Aggiungi un segnalibro</em>.</p>
</div>
<h3>Cos&rsquo;&egrave; il News Feed?</h3>
<div>
<p>Il <a href="http://10.24.5.144/nexu/" target="_blank">News Feed</a> &egrave; il raccoglitore delle notizie di tutto ci&ograve; che avviene su NEXU (aggiornamenti di status, nuovi blog post, segnalibri, discussioni, ecc...).</p>
</div>
<h3>Qual &egrave; il criterio di visualizzazione del News Feed?</h3>
<div>
<p>Nel News Feed vengono mostrati solo gli aggiornamenti relativi alle persone che segui e ai gruppi a cui stai iscritto.</p>
</div>
<h3>Quello che scrivo possono leggerlo tutti? Posso limitarne la visibilit&agrave;?</h3>
<div>
<p>In NEXU esistono diversi livelli di visibilit&agrave; per i contenuti inseriti. Ma in generale, se una persona ti segue, vede tutto ci&ograve; che scrivi. Questa condizione pu&ograve; essere modificata in due casi: se imposti la visibilit&agrave; di un tuo post (sia esso un blog post o un segnalibro) a <em>Privato</em>, solo tu sarai abilitato a vedere quello che hai scritto; al contrario, impostando la visibilit&agrave; a <em>Community</em>, tutti potranno vedere quello che scrivere a prescindere se sono persone che ti seguono o meno.</p>
<p>Tale funzionamento cambia leggermente all&rsquo;interno dei gruppi, nei quali sar&agrave; comunque possibile rendere i propri post privati o visibili all&rsquo;intera community, ma &egrave; possibile fare in modo che i contenuti inseriti siano visibili solo ai membri del gruppo.</p>
</div>
<h3>Che cosa sono gli hash tag? Come faccio ad inserirne uno?</h3>
<div>
<p>Gli hash tag non sono nient&rsquo;altro che delle etichette che hanno lo scopo di categorizzare i contenuti inseriti. Inserirne uno &egrave; facilissimo: basta far precedere la parola da utilizzare come hash tag da cancelletto (#). Ma <span style="text-decoration: underline;">attenzione</span>: nel form di compilazione di alcuni contenuti (come ad esempio un blog post o un segnalibro) &egrave; gi&agrave; presente un campo <em>Tags</em>, che potr&agrave; essere utilizzato al posto degli hash tag cos&igrave; come sono stati descritti poc&rsquo;anzi. In tal caso, non sar&agrave; necessario far precedere le parole dal cancelletto e dovr&agrave; essere utilizzata la virgola come carattere separatore tra pi&ugrave; tags.</p>
</div>
<h3>Come si fa a vedere chi sono le persone che seguo e quelle che mi seguono?</h3>
<div>
<p>&Egrave; necessario andare sul proprio profilo e cliccare sul link <em>Amici</em> sulla barra laterale sinistra. Fatto ci&ograve;, compariranno due apposite voci <em>Persone che seguo</em> e <em>Persone che mi seguono</em>, le quali ci consentiranno di vedere ci&ograve; che ci interessa.</p>
</div>
<h3>Come si fa a menzionare qualcuno?</h3>
<div>
<p>Menzionare qualcuno su NEXU &egrave; importante per coinvolgere in maniera diretta la persona desiderata (che sar&agrave; opportunamente notificata dell&rsquo;evento) su ci&ograve; che si sta scrivendo in quel momento. Per fare ci&ograve; occorre digitare il carattere chiocciola (@) e cominciare a scrivere. Sar&agrave; quindi mostrata una lista di nomi utente (sottoinsieme delle persone che si seguono) che contengono le lettere inserite fino a quel momento. A questo punto basta selezionare la persona di interesse ed il gioco &egrave; fatto.</p>
</div>
<h3>Posso creare un blog post trasversale a tutti i gruppi, ovvero visibile all&rsquo;intera community? Se si come?</h3>
<div>
<p>Si. Basta fare in modo che il blog post che si sta scrivendo abbia visibilit&agrave; impostata su <em>Community</em>. In tal caso &egrave; possibile scrivere il blog post sia all&rsquo;interno del gruppo e sia all&rsquo;esterno, usando l&rsquo;apposito strumento presente nella homepage (in alto al <a href="http://10.24.5.144/nexu/" target="_blank">News Feed</a>).</p>
</div>
<h3>Come si fa ad aggiungere un&rsquo;immagine in un blog post?</h3>
<div>
<p>Occorre prima caricare il file a parte (facendolo prima di scrivere un post o aprendo un&rsquo;altra scheda del browser se lo si sta gi&agrave; scrivendo), andando sulla homepage e cliccando sulla voce <a href="http://10.24.5.144/nexu/file/all"><em>Files</em></a>, presente nella barra laterale sinistra. Nella pagina che comparir&agrave;, premendo sul pulsante <em>Carica un file</em> in alto a destra, sar&agrave; possibile caricare l&rsquo;immagine a cui &egrave; necessario dare un titolo ed eventualmente una descrizione e dei tags per facilitarne la ricerca da parte di altri utenti. Scegliere il livello di visibilit&agrave; che pi&ugrave; si ritiene opportuno (tenendo presente che se lo si imposta su <em>Privato</em>, l&rsquo;immagine non sar&agrave; visibile agli altri utenti). Una volta cliccato su <em>Salva</em>, saremo portati su una pagina in cui sar&agrave; presente un link all&rsquo;immagine appena caricata. Cliccando sulla miniatura dell&rsquo;immagine, saremo portati all&rsquo;indirizzo sul quale &egrave; stata caricata l&rsquo;immagine, indirizzo che copieremo da qualche parte perch&eacute; ci servir&agrave; in un secondo momento.</p>
<p>Fatto questo, andiamo sulla pagina per modificare il blog post nel quale inserire l&rsquo;immagine. Nell&rsquo;editor apposito sar&agrave; presente un pulsante con l&rsquo;icona di un albero, cliccando sulla quale sar&agrave; mostrata una finestra a popup. Nella casella di testo con etichetta <em>Image URL</em> inserire l&rsquo;indirizzo copiato in precedenza e premere sul pulsante <em>Insert</em>. A quel punto l&rsquo;immagine sar&agrave; inserita nel post e saremo liberi di spostarla o dimensionarla a piacimento.</p>
</div>
<h3>Come faccio a ricevere le notifiche quando un utente di interesse inserisce nuovi contenuti?</h3>
<div>
<p>Basta seguire il link <a href="http://10.24.5.144/nexu/notifications/personal/" target="_blank"><em>Notifiche</em></a> (in alto a destra una volta cliccato sulla freccetta affianco ad <em>Home</em>). Sar&agrave; mostrata una pagina in cui, nella sezione Notifiche degli utenti preferiti, &egrave; possibile selezionare le persone di cui si &egrave; interessati a ricevere notifiche non appena aggiungono nuovi contenuti su NEXU.</p>
</div>
</div>
 
 
</body>
</html>